Перем _Вывод;
Перем _ТекстОшибки;
Перем КоличествоВызовов Экспорт; // Число - количество вызовов метода Исполнить.

#Область ПрограммныйИнтерфейс

// Создает имитацию команды с заданным выводом или ошибкой.
//
// Параметры:
//   Вывод - Строка - вывод команды.
//   ТекстОшибки - Строка - текст исключения при выполнении команды.
Процедура ПриСозданииОбъекта(Вывод = "", ТекстОшибки = "")

	_Вывод = Вывод;
	_ТекстОшибки = ТекстОшибки;
	КоличествоВызовов = 0;

КонецПроцедуры

// Имитирует выполнение команды.
Процедура Исполнить() Экспорт

	КоличествоВызовов = КоличествоВызовов + 1;
	Если ЗначениеЗаполнено(_ТекстОшибки) Тогда
		ВызватьИсключение _ТекстОшибки;
	КонецЕсли;

КонецПроцедуры

// Возвращает заданный вывод команды.
//
// Возвращаемое значение:
//   Строка - заданный вывод команды.
Функция ПолучитьВывод() Экспорт

	Возврат _Вывод;

КонецФункции

#КонецОбласти
