Перем _Сообщения;
Перем _Уровни;

#Область ПрограммныйИнтерфейс

// Возвращает накопленные сообщения лога.
//
// Возвращаемое значение:
//   Массив - сообщения, переданные в appender.
Функция ПолучитьСообщения() Экспорт

	Возврат _Сообщения;

КонецФункции

// Возвращает уровни накопленных сообщений лога.
//
// Возвращаемое значение:
//   Массив - уровни сообщений logos.
Функция ПолучитьУровни() Экспорт

	Возврат _Уровни;

КонецФункции

// Принимает сообщение от logos.
//
// Параметры:
//   Сообщение - Строка - форматированное сообщение.
//   УровеньВывода - Число - уровень сообщения logos.
Процедура Вывести(Сообщение, УровеньВывода) Экспорт

	_Сообщения.Добавить(Сообщение);
	_Уровни.Добавить(УровеньВывода);

КонецПроцедуры

// Завершает работу appender.
Процедура Закрыть() Экспорт

КонецПроцедуры

#КонецОбласти

_Сообщения = Новый Массив();
_Уровни = Новый Массив();
