// BSLLS:LatinAndCyrillicSymbolInWord-off

Перем _ТипПлатформы; // ТипПлатформы
Перем _ИсточникSysctl; // ИсточникИнформацииОПроцессореSysctl

#Область ОбработчикиСобытий

// Определяет характеристики процессора в macOS по данным sysctl.
Процедура ПриСозданииОбъекта()

	_ТипПлатформы = Новый СистемнаяИнформация().ТипПлатформы;
	_ИсточникSysctl = Новый ИсточникИнформацииОПроцессореSysctl();

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Проверяет доступность детектора на текущей платформе.
//
// Возвращаемое значение:
//   Булево - Истина, если текущая платформа macOS.
Функция Доступен() Экспорт

	Возврат _ТипПлатформы = ТипПлатформы.MacOS_x86
		Или _ТипПлатформы = ТипПлатформы.MacOS_x86_64;

КонецФункции

// Определяет характеристики процессора по данным sysctl.
//
// Возвращаемое значение:
//   ИнформацияОПроцессоре - определенные характеристики процессора.
//
// Исключения:
//   Детектор доступен только на MacOS - если текущая платформа не macOS.
Функция Определить() Экспорт

	Если Не Доступен() Тогда
		ВызватьИсключение "Детектор доступен только на MacOS";
	КонецЕсли;

	Возврат Новый ПарсерИнформацииОПроцессореSysctl().Распарсить(_ИсточникSysctl.Получить());

КонецФункции

#КонецОбласти
