// BSLLS:LatinAndCyrillicSymbolInWord-off

#Использовать logos

Перем _Лог; // Лог
Перем _ТипПлатформы; // ТипПлатформы
Перем _ИсточникSysctl; // ИсточникИнформацииОПроцессореSysctl

#Область ОбработчикиСобытий

// Определяет характеристики процессора в macOS по данным sysctl.
Процедура ПриСозданииОбъекта()

	_Лог = Логирование.ПолучитьЛог("oscript.lib.cpuinfo.macos.detector");
	_ТипПлатформы = Новый СистемнаяИнформация().ТипПлатформы;
	_ИсточникSysctl = Новый ИсточникИнформацииОПроцессореSysctl();

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Проверяет доступность детектора на текущей платформе.
//
// Возвращаемое значение:
//   Булево - Истина, если текущая платформа macOS.
Функция Доступен() Экспорт

	Возврат _ТипПлатформы = ТипПлатформы.MacOS_x86
		Или _ТипПлатформы = ТипПлатформы.MacOS_x86_64;

КонецФункции

// Определяет характеристики процессора по данным sysctl.
//
// Возвращаемое значение:
//   ИнформацияОПроцессоре - определенные характеристики процессора.
//
// Исключения:
//   Детектор доступен только на MacOS - если текущая платформа не macOS.
Функция Определить() Экспорт

	Если Не Доступен() Тогда
		ВызватьИсключение "Детектор доступен только на MacOS";
	КонецЕсли;

	_Лог.Отладка("Получение информации о процессоре через sysctl");

	Попытка
		ИнформацияОПроцессоре = Новый ПарсерИнформацииОПроцессореSysctl().Распарсить(_ИсточникSysctl.Получить());
	Исключение
		_Лог.Ошибка(
			"Не удалось получить информацию о процессоре через sysctl: %1",
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		ВызватьИсключение;
	КонецПопытки;

	_Лог.Отладка("Информация о процессоре получена через sysctl");

	Возврат ИнформацияОПроцессоре;

КонецФункции

#КонецОбласти
