// BSLLS:LatinAndCyrillicSymbolInWord-off

Перем _ТипПлатформы; // ТипПлатформы
Перем _ИсточникCpuInfo; // ИсточникИнформацииОПроцессореCpuInfo
Перем _ИсточникLscpu; // ИсточникИнформацииОПроцессореLscpu

#Область ОбработчикиСобытий

// Определяет характеристики процессора в Linux по данным /proc/cpuinfo и lscpu.
Процедура ПриСозданииОбъекта()

	_ТипПлатформы = Новый СистемнаяИнформация().ТипПлатформы;
	_ИсточникCpuInfo = Новый ИсточникИнформацииОПроцессореCpuInfo();
	_ИсточникLscpu = Новый ИсточникИнформацииОПроцессореLscpu();

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Проверяет доступность детектора на текущей платформе.
//
// Возвращаемое значение:
//   Булево - Истина, если текущая платформа Linux.
Функция Доступен() Экспорт

	Возврат _ТипПлатформы = ТипПлатформы.Linux_x86
		Или _ТипПлатформы = ТипПлатформы.Linux_x86_64;

КонецФункции

// Определяет характеристики процессора по данным /proc/cpuinfo и lscpu.
//
// Возвращаемое значение:
//   ИнформацияОПроцессоре - определенные характеристики процессора.
//
// Исключения:
//   Детектор доступен только на Linux - если текущая платформа не Linux.
Функция Определить() Экспорт

	Если Не Доступен() Тогда
		ВызватьИсключение "Детектор доступен только на Linux";
	КонецЕсли;

	Возврат Новый ПарсерИнформацииОПроцессореLinux().Распарсить(
		_ИсточникCpuInfo.Получить(),
		_ИсточникLscpu.Получить());

КонецФункции

#КонецОбласти
