#Область ПрограммныйИнтерфейс

// Получает и разбирает информацию о процессоре через WMIC.
//
// Возвращаемое значение:
//   ИнформацияОПроцессоре - информация, полученная через WMIC.
Функция Получить() Экспорт

	Возврат ПарсерИнформацииОПроцессореWmic.Распарсить(ПолучитьВывод());

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВывод()

	КомандыWindows = Новый КомандыПолученияИнформацииОПроцессореWindows();
	Команда = КомандыWindows.ДляWmic();
	Команда.Исполнить();

	Возврат Команда.ПолучитьВывод();

КонецФункции

#КонецОбласти
