#Область ПрограммныйИнтерфейс

// Получает и разбирает информацию о процессоре через CIM.
//
// Возвращаемое значение:
//   ИнформацияОПроцессоре - информация, полученная через CIM.
Функция Получить() Экспорт

	Возврат ПарсерИнформацииОПроцессореCim.Распарсить(ПолучитьВывод());

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВывод()

	КомандыWindows = Новый КомандыПолученияИнформацииОПроцессореWindows();
	Команда = КомандыWindows.ДляCim();
	Команда.Исполнить();

	Возврат Команда.ПолучитьВывод();

КонецФункции

#КонецОбласти
