#Использовать 1commands

#Область ПрограммныйИнтерфейс

// Получает сведения о процессоре через sysctl.
//
// Возвращаемое значение:
//   Строка - вывод команды sysctl.
Функция Получить() Экспорт

	Команда = Новый Команда;
	Команда.УстановитьИсполнениеЧерезКомандыСистемы(Ложь);
	Команда.УстановитьПравильныйКодВозврата(0);
	Команда.УстановитьКоманду("sysctl");
	Команда.ДобавитьПараметр("-i");
	Команда.ДобавитьПараметр("machdep.cpu.brand_string");
	Команда.ДобавитьПараметр("hw.packages");
	Команда.ДобавитьПараметр("hw.physicalcpu");
	Команда.ДобавитьПараметр("hw.logicalcpu");
	Команда.ДобавитьПараметр("hw.cpufrequency");
	Команда.ДобавитьПараметр("hw.cpufrequency_max");
	Команда.ДобавитьПараметр("hw.cputype");
	Команда.ДобавитьПараметр("hw.cpu64bit_capable");
	Команда.ДобавитьПараметр("sysctl.proc_translated");
	Команда.Исполнить();

	Возврат Команда.ПолучитьВывод();

КонецФункции

#КонецОбласти
