#Использовать 1commands
#Использовать fs

#Область ПрограммныйИнтерфейс

// Получает и разбирает информацию о процессоре через WMIC.
//
// Возвращаемое значение:
//   ИнформацияОПроцессоре - информация, полученная через WMIC.
Функция Получить() Экспорт

	Возврат ПарсерИнформацииОПроцессореWmic.Распарсить(ПолучитьВывод());

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВывод()

	ПутьКWmic = "C:\Windows\System32\wbem\WMIC.exe";
	Команда = Новый Команда;
	Команда.УстановитьИсполнениеЧерезКомандыСистемы(Ложь);
	Команда.УстановитьПравильныйКодВозврата(0);

	Если ФС.ФайлСуществует(ПутьКWmic) Тогда
		Команда.УстановитьКоманду(ПутьКWmic);
	Иначе
		Команда.УстановитьКоманду("wmic");
	КонецЕсли;

	Команда.ДобавитьПараметр(
		"cpu get Architecture, Name, NumberOfCores, NumberOfLogicalProcessors, MaxClockSpeed /Format:List");
	Команда.Исполнить();

	Возврат Команда.ПолучитьВывод();

КонецФункции

#КонецОбласти
