#Использовать 1commands

#Область ПрограммныйИнтерфейс

// Получает и разбирает информацию о процессоре через CIM.
//
// Возвращаемое значение:
//   ИнформацияОПроцессоре - информация, полученная через CIM.
Функция Получить() Экспорт

	Возврат ПарсерИнформацииОПроцессореCim.Распарсить(ПолучитьВывод());

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВывод()

	ПутьКPowershell = "C:\Windows\System32\WindowsPowerShell\v1.0\powershell.exe";

	// Используется "Команда" вместо "КомандныйФайл", так как выполнение сценариев может быть отключено в системе.
	Команда = Новый Команда;
	Команда.УстановитьИсполнениеЧерезКомандыСистемы(Ложь);
	Команда.УстановитьПравильныйКодВозврата(0);
	Команда.УстановитьКоманду(ПутьКPowershell);
	Команда.ДобавитьПараметр(
		"""Get-CimInstance Win32_Processor | Format-List Architecture, Name, NumberOfCores, NumberOfLogicalProcessors, MaxClockSpeed""");
	Команда.Исполнить();

	Возврат Команда.ПолучитьВывод();

КонецФункции

#КонецОбласти
