#Использовать 1commands
#Использовать fs

#Область ПрограммныйИнтерфейс

// Создает команду получения информации о процессоре через CIM.
//
// Возвращаемое значение:
//   Команда - настроенная команда PowerShell.
Функция ДляCim() Экспорт

	ПутьКPowershell = ПолучитьПеременнуюСреды("SystemRoot")
		+ "\System32\WindowsPowerShell\v1.0\powershell.exe";

	// Используется "Команда" вместо "КомандныйФайл", так как выполнение сценариев может быть отключено в системе.
	Команда = Новый Команда;
	Команда.УстановитьИсполнениеЧерезКомандыСистемы(Ложь);
	Команда.УстановитьПравильныйКодВозврата(0);
	Команда.УстановитьКоманду(ПутьКPowershell);
	Команда.ДобавитьПараметр(
		"""Get-CimInstance Win32_Processor -ErrorAction Stop | Format-List Architecture, Name, NumberOfCores, NumberOfLogicalProcessors, MaxClockSpeed""");

	Возврат Команда;

КонецФункции

// Создает команду получения информации о процессоре через WMIC.
//
// Возвращаемое значение:
//   Команда - настроенная команда WMIC.
Функция ДляWmic() Экспорт

	ПутьКWmic = ПолучитьПеременнуюСреды("SystemRoot") + "\System32\wbem\WMIC.exe";

	Команда = Новый Команда;
	Команда.УстановитьИсполнениеЧерезКомандыСистемы(Ложь);
	Команда.УстановитьПравильныйКодВозврата(0);

	Если ФС.ФайлСуществует(ПутьКWmic) Тогда
		Команда.УстановитьКоманду(ПутьКWmic);
	Иначе
		Команда.УстановитьКоманду("wmic");
	КонецЕсли;

	Команда.ДобавитьПараметр(
		"cpu get Architecture, Name, NumberOfCores, NumberOfLogicalProcessors, MaxClockSpeed /Format:List");

	Возврат Команда;

КонецФункции

#КонецОбласти
