#Использовать "helpers"

#Область Тесты

&Тест
Процедура ТестДолжен_ПреобразовыватьОдиночныйОбъектCimJson() Экспорт

	// Подготовка
	ТекстJSON = "{""Architecture"":9,""Name"":""Intel(R) Core(TM) i5-8500 CPU @ 3.00GHz"","
		+ """NumberOfCores"":6,""NumberOfLogicalProcessors"":6,""MaxClockSpeed"":3000}";

	// Действие
	Информация = ИнформацияИзCimJSON(ТекстJSON);

	// Проверка
	ПроверитьИнформацию(Информация, "Intel(R) Core(TM) i5-8500 CPU @ 3.00GHz", 1, 6, 6, 3000000000);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПреобразовыватьМассивCimJson() Экспорт

	// Подготовка
	ТекстJSON = "[{""Architecture"":9,""Name"":""Первый CPU"",""NumberOfCores"":4,"
		+ """NumberOfLogicalProcessors"":8,""MaxClockSpeed"":2000},"
		+ "{""Architecture"":9,""Name"":""Второй CPU"",""NumberOfCores"":6,"
		+ """NumberOfLogicalProcessors"":12,""MaxClockSpeed"":3000}]";

	// Действие
	Информация = ИнформацияИзCimJSON(ТекстJSON);

	// Проверка
	ПроверитьИнформацию(Информация, "Первый CPU, Второй CPU", 2, 10, 20, 3000000000);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнформацияИзCimJSON(ТекстJSON)

	Экземпляры = ПарсерДанныхПроцессораCim.Распарсить(ТекстJSON);
	Возврат Новый ПреобразовательДанныхПроцессораWindows().Преобразовать(Экземпляры);

КонецФункции

Процедура ПроверитьИнформацию(
		Информация,
		Имя,
		КоличествоПроцессоров,
		КоличествоЯдер,
		КоличествоЛогическихПроцессоров,
		Частота)

	Ожидаем.Что(Информация.ИмяПроцессора).Равно(Имя);
	Ожидаем.Что(Информация.КоличествоПроцессоров).Равно(КоличествоПроцессоров);
	Ожидаем.Что(Информация.КоличествоЯдер).Равно(КоличествоЯдер);
	Ожидаем.Что(Информация.КоличествоЛогическихПроцессоров).Равно(КоличествоЛогическихПроцессоров);
	Ожидаем.Что(Информация.НоминальнаяЧастота).Равно(Частота);
	Ожидаем.Что(Информация.МаксимальнаяЧастота).Равно(Частота);
	Ожидаем.Что(Информация.Архитектура).Равно(АрхитектурыПроцессоров.X64);

КонецПроцедуры

#КонецОбласти
