#Использовать "helpers"

&Тест
Процедура ПустойТест() Экспорт
	
	ОжидаемоеЗначение = Новый ИнформацияОПроцессоре(Ложь);

	ПроверяемоеЗначение = ПарсерИнформацииОПроцессореWmic.Распарсить("");

	ТестированиеИнформацииОПроцессоре.ПроверитьРавенство(ПроверяемоеЗначение, ОжидаемоеЗначение);

КонецПроцедуры

&Тест
Процедура НеверноеФорматирование() Экспорт
	
	ОжидаемоеЗначение = Новый ИнформацияОПроцессоре(Ложь);

	ПроверяемоеЗначение = ПарсерИнформацииОПроцессореWmic.Распарсить("malformedkey: malformedvalue\n\nmalformedkey2: malformedvalue2");

	ТестированиеИнформацииОПроцессоре.ПроверитьРавенство(ПроверяемоеЗначение, ОжидаемоеЗначение);

КонецПроцедуры

&Тест
Процедура ДваПроцессораПоВосемьЯдер() Экспорт
	
	ОжидаемоеЗначение = Новый ИнформацияОПроцессоре(Ложь);
	ОжидаемоеЗначение.ИмяПроцессора = "Intel(R) Xeon(R) CPU E5-2630 v3 @ 2.40GHz";
	ОжидаемоеЗначение.КоличествоПроцессоров = 2;
	ОжидаемоеЗначение.КоличествоЯдер = 16;
	ОжидаемоеЗначение.КоличествоЛогическихПроцессоров = 32;
	ОжидаемоеЗначение.НоминальнаяЧастота = 2400000000;
	ОжидаемоеЗначение.МаксимальнаяЧастота = 2400000000;

	ТекстоваяИнформация = "
	|MaxClockSpeed=2400
	|Name=Intel(R) Xeon(R) CPU E5-2630 v3 @ 2.40GHz
	|NumberOfCores=8
	|NumberOfLogicalProcessors=16
	|
	|
	|MaxClockSpeed=2400
	|Name=Intel(R) Xeon(R) CPU E5-2630 v3 @ 2.40GHz
	|NumberOfCores=8
	|NumberOfLogicalProcessors=16";

	ПроверяемоеЗначение = ПарсерИнформацииОПроцессореWmic.Распарсить(ТекстоваяИнформация);

	ТестированиеИнформацииОПроцессоре.ПроверитьРавенство(ПроверяемоеЗначение, ОжидаемоеЗначение);

КонецПроцедуры

&Тест
Процедура ДваПроцессораПоВосемьЯдерСБагомWmic() Экспорт
	
	ОжидаемоеЗначение = Новый ИнформацияОПроцессоре(Ложь);
	ОжидаемоеЗначение.ИмяПроцессора = "Intel(R) Xeon(R) CPU E5-2687W 0 @ 3.10GHz";
	ОжидаемоеЗначение.КоличествоПроцессоров = 2;
	ОжидаемоеЗначение.КоличествоЯдер = 16;
	ОжидаемоеЗначение.КоличествоЛогическихПроцессоров = 32;
	ОжидаемоеЗначение.НоминальнаяЧастота = 3111000000;
	ОжидаемоеЗначение.МаксимальнаяЧастота = 3111000000;

	ТекстоваяИнформация = 
	"\r\r\n" +
	"\r\r\n" +
	"MaxClockSpeed=3111\r\r\n" +
	"Name=Intel(R) Xeon(R) CPU E5-2687W 0 @ 3.10GHz\r\r\n" +
	"NumberOfCores=8\r\r\n" +
	"NumberOfLogicalProcessors=16\r\r\n" +
	"\r\r\n" +
	"\r\r\n" +
	"MaxClockSpeed=3111\r\r\n" +
	"Name=Intel(R) Xeon(R) CPU E5-2687W 0 @ 3.10GHz\r\r\n" +
	"NumberOfCores=8\r\r\n" +
	"NumberOfLogicalProcessors=16\r\r\n" +
	"\r\r\n" +
	"\r\r\n" +
	"\r\r\n";
	ТекстоваяИнформация = СтрЗаменить(ТекстоваяИнформация, "\n", Символы.ПС);
	ТекстоваяИнформация = СтрЗаменить(ТекстоваяИнформация, "\r", Символы.ВК);

	ПроверяемоеЗначение = ПарсерИнформацииОПроцессореWmic.Распарсить(ТекстоваяИнформация);

	ТестированиеИнформацииОПроцессоре.ПроверитьРавенство(ПроверяемоеЗначение, ОжидаемоеЗначение);

КонецПроцедуры

&Тест
Процедура ОдинПроцессорЧетыреЯдра() Экспорт
	
	ОжидаемоеЗначение = Новый ИнформацияОПроцессоре(Ложь);
	ОжидаемоеЗначение.ИмяПроцессора = "Intel(R) Core(TM) i7-4710MQ CPU @ 2.50GHz";
	ОжидаемоеЗначение.КоличествоПроцессоров = 1;
	ОжидаемоеЗначение.КоличествоЯдер = 4;
	ОжидаемоеЗначение.КоличествоЛогическихПроцессоров = 8;
	ОжидаемоеЗначение.НоминальнаяЧастота = 2500000000;
	ОжидаемоеЗначение.МаксимальнаяЧастота = 2500000000;

	ТекстоваяИнформация = "
	|MaxClockSpeed=2500
	|Name=Intel(R) Core(TM) i7-4710MQ CPU @ 2.50GHz
	|NumberOfCores=4
	|NumberOfLogicalProcessors=8";

	ПроверяемоеЗначение = ПарсерИнформацииОПроцессореWmic.Распарсить(ТекстоваяИнформация);

	ТестированиеИнформацииОПроцессоре.ПроверитьРавенство(ПроверяемоеЗначение, ОжидаемоеЗначение);

КонецПроцедуры