#Область Тесты

&Тест
Процедура ТестДолжен_ВозвращатьПустойМассивДляПустогоВыводаWmic() Экспорт

	// Действие
	Данные = ПарсерДанныхПроцессораWmic.Распарсить("");

	// Проверка
	Ожидаем.Что(Данные.Количество()).Равно(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИгнорироватьНеверноОтформатированныйВыводWmic() Экспорт

	// Подготовка
	ТекстWmic = "malformedkey: malformedvalue\n\nmalformedkey2: malformedvalue2";

	// Действие
	Данные = ПарсерДанныхПроцессораWmic.Распарсить(ТекстWmic);

	// Проверка
	Ожидаем.Что(Данные.Количество()).Равно(0);

КонецПроцедуры

&Тест
Процедура ТестДолжен_РазбиратьДанныеОдногоПроцессораWmic() Экспорт

	// Подготовка
	ТекстWmic = "
	|Architecture=9
	|MaxClockSpeed=2500
	|Name=Intel(R) Core(TM) i7 CPU
	|NumberOfCores=4
	|NumberOfLogicalProcessors=8";

	// Действие
	Данные = ПарсерДанныхПроцессораWmic.Распарсить(ТекстWmic);

	// Проверка
	Ожидаем.Что(Данные.Количество()).Равно(1);
	ПроверитьДанныеПроцессора(Данные[0], "Intel(R) Core(TM) i7 CPU", "4", "8", "2500");
	Ожидаем.Что(Данные[0]["Architecture"]).Равно("9");

КонецПроцедуры

&Тест
Процедура ТестДолжен_РазбиратьДанныеНесколькихПроцессоровWmic() Экспорт

	// Подготовка
	ТекстWmic = "
	|Architecture=9
	|MaxClockSpeed=2400
	|Name=Первый CPU
	|NumberOfCores=8
	|NumberOfLogicalProcessors=16
	|
	|
	|Architecture=9
	|MaxClockSpeed=3200
	|Name=Второй CPU
	|NumberOfCores=12
	|NumberOfLogicalProcessors=24";

	// Действие
	Данные = ПарсерДанныхПроцессораWmic.Распарсить(ТекстWmic);

	// Проверка
	Ожидаем.Что(Данные.Количество()).Равно(2);
	ПроверитьДанныеПроцессора(Данные[0], "Первый CPU", "8", "16", "2400");
	ПроверитьДанныеПроцессора(Данные[1], "Второй CPU", "12", "24", "3200");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИсправлятьДвойныеПереводыСтрокWmic() Экспорт

	// Подготовка
	ТекстWmic =
		"\r\r\n" +
		"\r\r\n" +
		"Architecture=9\r\r\n" +
		"MaxClockSpeed=3111\r\r\n" +
		"Name=Первый CPU\r\r\n" +
		"NumberOfCores=8\r\r\n" +
		"NumberOfLogicalProcessors=16\r\r\n" +
		"\r\r\n" +
		"Architecture=9\r\r\n" +
		"MaxClockSpeed=3111\r\r\n" +
		"Name=Второй CPU\r\r\n" +
		"NumberOfCores=8\r\r\n" +
		"NumberOfLogicalProcessors=16\r\r\n" +
		"\r\r\n" +
		"\r\r\n";
	ТекстWmic = СтрЗаменить(ТекстWmic, "\n", Символы.ПС);
	ТекстWmic = СтрЗаменить(ТекстWmic, "\r", Символы.ВК);

	// Действие
	Данные = ПарсерДанныхПроцессораWmic.Распарсить(ТекстWmic);

	// Проверка
	Ожидаем.Что(Данные.Количество()).Равно(2);
	ПроверитьДанныеПроцессора(Данные[0], "Первый CPU", "8", "16", "3111");
	ПроверитьДанныеПроцессора(Данные[1], "Второй CPU", "8", "16", "3111");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СквознымОбразомПреобразовыватьWmic() Экспорт

	// Подготовка
	ТекстWmic = "
	|Architecture=9
	|MaxClockSpeed=2400
	|Name=Intel(R) Xeon(R) CPU E5-2630 v3 @ 2.40GHz
	|NumberOfCores=8
	|NumberOfLogicalProcessors=16
	|
	|
	|Architecture=9
	|MaxClockSpeed=2400
	|Name=Intel(R) Xeon(R) CPU E5-2630 v3 @ 2.40GHz
	|NumberOfCores=8
	|NumberOfLogicalProcessors=16";

	// Действие
	Экземпляры = ПарсерДанныхПроцессораWmic.Распарсить(ТекстWmic);
	Информация = Новый ПреобразовательДанныхПроцессораWindows().Преобразовать(Экземпляры);

	// Проверка
	Ожидаем.Что(Информация.ИмяПроцессора).Равно("Intel(R) Xeon(R) CPU E5-2630 v3 @ 2.40GHz");
	Ожидаем.Что(Информация.КоличествоПроцессоров).Равно(2);
	Ожидаем.Что(Информация.КоличествоЯдер).Равно(16);
	Ожидаем.Что(Информация.КоличествоЛогическихПроцессоров).Равно(32);
	Ожидаем.Что(Информация.НоминальнаяЧастота).Равно(2400000000);
	Ожидаем.Что(Информация.МаксимальнаяЧастота).Равно(2400000000);
	Ожидаем.Что(Информация.Архитектура).Равно(АрхитектурыПроцессоров.X64);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДанныеПроцессора(Данные, Имя, КоличествоЯдер, КоличествоЛогическихПроцессоров, Частота)

	Ожидаем.Что(Данные["Name"]).Равно(Имя);
	Ожидаем.Что(Данные["NumberOfCores"]).Равно(КоличествоЯдер);
	Ожидаем.Что(Данные["NumberOfLogicalProcessors"]).Равно(КоличествоЛогическихПроцессоров);
	Ожидаем.Что(Данные["MaxClockSpeed"]).Равно(Частота);

КонецПроцедуры

#КонецОбласти
