#Использовать "helpers"
#Использовать fs

Перем _ИсходныйSystemRoot;
Перем _ТестовыйSystemRoot;

#Область ОбработчикиСобытий

&Перед
Процедура ПередТестом() Экспорт

	_ИсходныйSystemRoot = ПолучитьПеременнуюСреды("SystemRoot");
	_ТестовыйSystemRoot = ПолучитьИмяВременногоФайла();
	УдалитьФайлы(_ТестовыйSystemRoot);
	ФС.ОбеспечитьКаталог(_ТестовыйSystemRoot);
	УстановитьПеременнуюСреды("SystemRoot", _ТестовыйSystemRoot);

КонецПроцедуры

&После
Процедура ПослеТеста() Экспорт

	УстановитьПеременнуюСреды("SystemRoot", _ИсходныйSystemRoot);
	УдалитьФайлы(_ТестовыйSystemRoot);

КонецПроцедуры

#КонецОбласти

#Область Тесты

&Тест
Процедура ТестДолжен_ФормироватьПутьКPowerShellИзSystemRoot() Экспорт

	// Подготовка
	КомандыWindows = Новый КомандыПолученияИнформацииОПроцессореWindows();

	// Действие
	Команда = КомандыWindows.ДляCim();

	// Проверка
	Ожидаем.Что(Команда.ПолучитьКоманду()).Равно(
		_ТестовыйSystemRoot + "\System32\WindowsPowerShell\v1.0\powershell.exe");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОстанавливатьPowerShellПриОшибкеCim() Экспорт

	// Подготовка
	КомандыWindows = Новый КомандыПолученияИнформацииОПроцессореWindows();

	// Действие
	Команда = КомандыWindows.ДляCim();
	Параметры = Команда.ПолучитьПараметры();

	// Проверка
	Ожидаем.Что(Параметры[0]).Содержит("Get-CimInstance Win32_Processor -ErrorAction Stop");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИспользоватьWmicИзPathЕслиФайлОтсутствуетВSystemRoot() Экспорт

	// Подготовка
	КомандыWindows = Новый КомандыПолученияИнформацииОПроцессореWindows();

	// Действие
	Команда = КомандыWindows.ДляWmic();

	// Проверка
	Ожидаем.Что(Команда.ПолучитьКоманду()).Равно("wmic");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИспользоватьWmicИзSystemRoot() Экспорт

	// Подготовка
	Детектор = Новый ДетекторПроцессораWindows();
	Если Не Детектор.Доступен() Тогда
		Возврат;
	КонецЕсли;
	КаталогWmic = _ТестовыйSystemRoot + "\System32\wbem";
	ПутьКWmic = КаталогWmic + "\WMIC.exe";
	ФС.ОбеспечитьКаталог(КаталогWmic);
	ЗаписьТекста = Новый ЗаписьТекста(ПутьКWmic);
	ЗаписьТекста.Закрыть();
	КомандыWindows = Новый КомандыПолученияИнформацииОПроцессореWindows();

	// Действие
	Команда = КомандыWindows.ДляWmic();

	// Проверка
	Ожидаем.Что(Команда.ПолучитьКоманду()).Равно(ПутьКWmic);

КонецПроцедуры

#КонецОбласти
