#Использовать "helpers"

#Область Тесты

&Тест
Процедура ТестДолжен_НаходитьИзвестнуюМикроархитектуруПроцессора() Экспорт

	// Действие
	ПроверяемоеЗначение = ИзвестныеМикроархитектурыПроцессоров.ПолучитьМикроархитектуру("14900HX");

	// Проверка
	Ожидаем.Что(ПроверяемоеЗначение).Равно("Raptor Lake-HX");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ВозвращатьНеопределеноДляНеизвестнойМоделиПроцессора() Экспорт

	// Действие
	ПроверяемоеЗначение = ИзвестныеМикроархитектурыПроцессоров.ПолучитьМикроархитектуру("Неизвестная модель");

	// Проверка
	Ожидаем.Что(ПроверяемоеЗначение).ЭтоНеопределено();

КонецПроцедуры

#КонецОбласти
