#Использовать "helpers"

#Область Тесты

&Тест
Процедура ТестДолжен_ВозвращатьПустуюИнформациюДляПустогоSysctl() Экспорт
	
	// Подготовка
	ОжидаемоеЗначение = Новый ИнформацияОПроцессоре(Ложь);

	// Действие
	ПроверяемоеЗначение = Новый ПарсерИнформацииОПроцессореSysctl().Распарсить("");

	// Проверка
	ТестированиеИнформацииОПроцессоре.ПроверитьРавенство(ПроверяемоеЗначение, ОжидаемоеЗначение);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИгнорироватьНеверноОтформатированныйSysctl() Экспорт
	
	// Подготовка
	ОжидаемоеЗначение = Новый ИнформацияОПроцессоре(Ложь);

	Sysctl = "malformedkey: malformedvalue\n\nmalformedkey2: malformedvalue2";

	// Действие
	ПроверяемоеЗначение = Новый ПарсерИнформацииОПроцессореSysctl().Распарсить(Sysctl);

	// Проверка
	ТестированиеИнформацииОПроцессоре.ПроверитьРавенство(ПроверяемоеЗначение, ОжидаемоеЗначение);

КонецПроцедуры

&Тест
Процедура ТестДолжен_РаспознаватьОдинПроцессорСЧетырьмяЯдрамиSysctl() Экспорт
	
	// Подготовка
	ОжидаемоеЗначение = Новый ИнформацияОПроцессоре(Ложь);
	ОжидаемоеЗначение.ИмяПроцессора = "Intel(R) Core(TM) i7-4770HQ CPU @ 2.20GHz";
	ОжидаемоеЗначение.КоличествоПроцессоров = 1;
	ОжидаемоеЗначение.КоличествоЯдер = 4;
	ОжидаемоеЗначение.КоличествоЛогическихПроцессоров = 8;
	ОжидаемоеЗначение.НоминальнаяЧастота = 2200000000;
	ОжидаемоеЗначение.МаксимальнаяЧастота = 2200000000;
	ОжидаемоеЗначение.Архитектура = АрхитектурыПроцессоров.X64;

	Sysctl = ТестированиеИнформацииОПроцессоре.ПрочитатьФайл("SysctlRealOneProcessorFourCores.txt");

	// Действие
	ПроверяемоеЗначение = Новый ПарсерИнформацииОПроцессореSysctl().Распарсить(Sysctl);

	// Проверка
	ТестированиеИнформацииОПроцессоре.ПроверитьРавенство(ПроверяемоеЗначение, ОжидаемоеЗначение);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ОпределятьАрхитектуруПоДаннымSysctl() Экспорт
	
	// Подготовка
	ТестовыеСлучаи = Новый Соответствие();
	ТестовыеСлучаи.Вставить(
		"hw.cputype: 16777223
		|hw.cpu64bit_capable: 1", АрхитектурыПроцессоров.X64);

	ТестовыеСлучаи.Вставить(
		"hw.cputype: 7
		|hw.cpu64bit_capable: 0", АрхитектурыПроцессоров.X86);	

	ТестовыеСлучаи.Вставить(
		"hw.cputype: 7
		|hw.cpu64bit_capable: 1", АрхитектурыПроцессоров.X64);

	ТестовыеСлучаи.Вставить(
		"hw.cputype: 16777228
		|hw.cpu64bit_capable: 1", АрхитектурыПроцессоров.ARM64);

	ТестовыеСлучаи.Вставить(
		"hw.cputype: 12
		|hw.cpu64bit_capable: 0", АрхитектурыПроцессоров.ARM);

	ТестовыеСлучаи.Вставить(
		"hw.cputype: 12
		|hw.cpu64bit_capable: 1", АрхитектурыПроцессоров.ARM64);	

	ТестовыеСлучаи.Вставить("", Неопределено);
				
	ПризнакиЭмуляцииX64 = Новый Массив();
	ПризнакиЭмуляцииX64.Добавить(Истина);
	ПризнакиЭмуляцииX64.Добавить(Ложь);

	// Действие и Проверка
	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл

		Sysctl = ТестовыйСлучай.Ключ;

		Для Каждого ЭмуляцияX64 Из ПризнакиЭмуляцииX64 Цикл

			SysctlСПризнакомЭмуляции = Sysctl;
			Если ЭмуляцияX64 Тогда
				SysctlСПризнакомЭмуляции = SysctlСПризнакомЭмуляции
					+ Символы.ПС + "sysctl.proc_translated: 1";
			КонецЕсли;

			Если ЭмуляцияX64 Тогда
				ОжидаемаяАрхитектура = АрхитектурыПроцессоров.ARM64;
			Иначе
				ОжидаемаяАрхитектура = ТестовыйСлучай.Значение;
			КонецЕсли;

			ОжидаемоеЗначение = Новый ИнформацияОПроцессоре(Ложь);
			ОжидаемоеЗначение.Архитектура = ОжидаемаяАрхитектура;
		
			ПроверяемоеЗначение = Новый ПарсерИнформацииОПроцессореSysctl().Распарсить(SysctlСПризнакомЭмуляции);
			
			Описание = СтрШаблон("Sysctl: %1
			|Эмуляция X64: %2", Sysctl, ЭмуляцияX64);

			ТестированиеИнформацииОПроцессоре.ПроверитьРавенство(ПроверяемоеЗначение, ОжидаемоеЗначение, Описание);

		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
