Перем _ИнформацияОПроцессоре; // ИнформацияОПроцессоре, Неопределено

#Область ПрограммныйИнтерфейс

// Определяет характеристики процессора и кэширует результат.
//
// Возвращаемое значение:
//   ИнформацияОПроцессоре, Неопределено - характеристики процессора или Неопределено,
//                                         если подходящий детектор не найден.

Функция Определить() Экспорт

	Если Не _ИнформацияОПроцессоре = Неопределено Тогда
		Возврат _ИнформацияОПроцессоре;
	КонецЕсли;

	Для Каждого Детектор Из Детекторы() Цикл
		Если Детектор.Доступен() Тогда
			_ИнформацияОПроцессоре = Детектор.Определить();
			Возврат _ИнформацияОПроцессоре;
		КонецЕсли;
	КонецЦикла;

КонецФункции

// Очищает кэш определённых характеристик процессора.
Процедура ОчиститьКэш() Экспорт
	_ИнформацияОПроцессоре = Неопределено;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Детекторы()

	Детекторы = Новый Массив();
	Детекторы.Добавить(Новый ДетекторПроцессораWindows());
	Детекторы.Добавить(Новый ДетекторПроцессораLinux());
	Детекторы.Добавить(Новый ДетекторПроцессораMacOS());

	Возврат Детекторы;

КонецФункции

#КонецОбласти
