Перем _Микроархитектуры; // Соответствие

#Область ПрограммныйИнтерфейс

// Возвращает известную микроархитектуру процессора по номеру модели.
//
// Параметры:
//   НомерМодели - Строка - номер модели процессора.
//
// Возвращаемое значение:
//   Строка, Неопределено - известная микроархитектура или Неопределено, если модель не найдена.
Функция ПолучитьМикроархитектуру(НомерМодели) Экспорт

	Возврат Микроархитектуры()[НомерМодели];

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Микроархитектуры()

	Если _Микроархитектуры = Неопределено Тогда
		_Микроархитектуры = ЗагрузитьМикроархитектуры();
	КонецЕсли;

	Возврат _Микроархитектуры;

КонецФункции

Функция ЗагрузитьМикроархитектуры()

	ПутьКФайлу = ОбъединитьПути(ТекущийСценарий().Каталог, "../../Ресурсы", "microarchitectures.txt");

	Результат = Новый Соответствие();
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу);
	ТекущаяМикроархитектура = "";

	Пока Истина Цикл

		Строка = ЧтениеТекста.ПрочитатьСтроку();
		Если Строка = Неопределено Тогда
			Прервать;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Строка) Или СтрНачинаетсяС(Строка, "//") Тогда
			Продолжить;
		КонецЕсли;

		Если СтрНачинаетсяС(Строка, "#") Тогда
			ТекущаяМикроархитектура = СокрЛП(Сред(Строка, 2));
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(ТекущаяМикроархитектура) Тогда
			Продолжить;
		КонецЕсли;

		НомерМодели = СокрЛП(Строка);
		Результат[НомерМодели] = ТекущаяМикроархитектура;

	КонецЦикла;

	ЧтениеТекста.Закрыть();

	Возврат Результат;

КонецФункции

#КонецОбласти
