Функция Распарсить(Cpuinfo, Lscpu) Экспорт

	ИнформацияОПроцессоре = Новый ИнформацияОПроцессоре(Ложь);
	ИменаМоделей = Новый Массив();
	РезервныеИменаМоделей = Новый Структура();
	РезервныеИменаМоделей.Вставить("Процессор", "");
	РезервныеИменаМоделей.Вставить("Оборудование", "");

	РаспарситьCpuInfo(Cpuinfo, ИнформацияОПроцессоре, ИменаМоделей, РезервныеИменаМоделей);
	РаспарситьLscpu(Lscpu, ИнформацияОПроцессоре, ИменаМоделей);

	Если ИменаМоделей.Количество() = 0 Тогда
		Если ЗначениеЗаполнено(РезервныеИменаМоделей.Процессор) Тогда
			ИменаМоделей.Добавить(РезервныеИменаМоделей.Процессор);
		ИначеЕсли ЗначениеЗаполнено(РезервныеИменаМоделей.Оборудование) Тогда
			ИменаМоделей.Добавить(РезервныеИменаМоделей.Оборудование);
		КонецЕсли;
	КонецЕсли;

	Если ИнформацияОПроцессоре.КоличествоПроцессоров = 0
		И (ИнформацияОПроцессоре.КоличествоЛогическихПроцессоров > 0
			Или ИнформацияОПроцессоре.КоличествоЯдер > 0) Тогда
		ИнформацияОПроцессоре.КоличествоПроцессоров = 1;
	КонецЕсли;

	НоминальнаяЧастота = ПолучитьЧастотуИзСпискаМоделей(ИменаМоделей);
	Если НоминальнаяЧастота = 0 Тогда
		НоминальнаяЧастота = ИнформацияОПроцессоре.МаксимальнаяЧастота;
	КонецЕсли;

	ИнформацияОПроцессоре.НоминальнаяЧастота = НоминальнаяЧастота;
	ИнформацияОПроцессоре.ИмяПроцессора = СтрСоединить(ИменаМоделей, ", ");
	
	Возврат ИнформацияОПроцессоре;
	
КонецФункции

Процедура РаспарситьCpuInfo(Cpuinfo, ИнформацияОПроцессоре, ИменаМоделей, РезервныеИменаМоделей)

	КоличествоЯдерПоПроцессорам = Новый Соответствие();
	ИдентификаторыПроцессоров = Новый Соответствие();
	ИдентификаторыЯдер = Новый Соответствие();

	Процессоры = ПарсерСекцийИнформацииОПроцессоре.РаспарситьСекции(Cpuinfo, ":");
	Для Каждого Процессор Из Процессоры Цикл

		Идентификатор = Процессор["physical id"];
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			ИдентификаторыПроцессоров[Идентификатор] = Истина;
		КонецЕсли;

		ИдентификаторЯдра = Процессор["core id"];
		Если ЗначениеЗаполнено(Идентификатор)
			И ЗначениеЗаполнено(ИдентификаторЯдра) Тогда
			КлючЯдра = СтрШаблон("%1:%2", Идентификатор, ИдентификаторЯдра);
			ИдентификаторыЯдер[КлючЯдра] = Истина;
		КонецЕсли;

		КоличествоЯдер = КонвертацияЗначенийCpuInfo.СтрокаВЧисло(Процессор["cpu cores"]);
		Если ЗначениеЗаполнено(Идентификатор) И КоличествоЯдер > 0 Тогда
			КоличествоЯдерПоПроцессорам[Идентификатор] = КоличествоЯдер;
		КонецЕсли;

		ИмяМодели = Процессор["model name"];
		Если ЗначениеЗаполнено(ИмяМодели) Тогда
			Если ИменаМоделей.Найти(ИмяМодели) = Неопределено Тогда
				ИменаМоделей.Добавить(ИмяМодели);
			КонецЕсли;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(РезервныеИменаМоделей.Процессор)
			И ЗначениеЗаполнено(Процессор["Processor"]) Тогда
			РезервныеИменаМоделей.Процессор = Процессор["Processor"];
		КонецЕсли;

		Если Не ЗначениеЗаполнено(РезервныеИменаМоделей.Оборудование)
			И ЗначениеЗаполнено(Процессор["Hardware"]) Тогда
			РезервныеИменаМоделей.Оборудование = Процессор["Hardware"];
		КонецЕсли;

		Если ЗначениеЗаполнено(Процессор["processor"]) Тогда
			ИнформацияОПроцессоре.КоличествоЛогическихПроцессоров =
				ИнформацияОПроцессоре.КоличествоЛогическихПроцессоров + 1;
		КонецЕсли;

		МаксимальнаяЧастота = КонвертацияЗначенийCpuInfo.СтрокаВЧисло(Процессор["max freq"]);
		МаксимальнаяЧастота = КонвертацияЗначенийCpuInfo.МегагерцыВГерцы(МаксимальнаяЧастота);
		Если МаксимальнаяЧастота > 0 Тогда
			ИнформацияОПроцессоре.МаксимальнаяЧастота = МаксимальнаяЧастота;
		КонецЕсли;

	КонецЦикла;

	Если ИдентификаторыЯдер.Количество() > 0 Тогда
		ИнформацияОПроцессоре.КоличествоЯдер = ИдентификаторыЯдер.Количество();
	Иначе
		Для Каждого Строка Из КоличествоЯдерПоПроцессорам Цикл
			ИнформацияОПроцессоре.КоличествоЯдер = ИнформацияОПроцессоре.КоличествоЯдер + Строка.Значение;
		КонецЦикла;
	КонецЕсли;

	ИнформацияОПроцессоре.КоличествоПроцессоров = ИдентификаторыПроцессоров.Количество();

КонецПроцедуры

Процедура РаспарситьLscpu(Lscpu, ИнформацияОПроцессоре, ИменаМоделей)
	
	Если Не ЗначениеЗаполнено(Lscpu) Тогда
		Возврат;
	КонецЕсли;

	КоличествоЯдерВСокете = 0;
	КоличествоЛогическихПроцессоров = 0;
	КоличествоСокетов = 0;

	МассивСтрок = ПарсерСекцийИнформацииОПроцессоре.РаспарситьСекцию(Lscpu, ":");
	Для Каждого Строка Из МассивСтрок Цикл

		Имя = СокрЛП(НРег(Строка.Ключ));
		Значение = СокрЛП(Строка.Значение);

		Если Не ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;

		Если Имя = "cpu max mhz" 
			И ИнформацияОПроцессоре.МаксимальнаяЧастота = 0 Тогда
			МаксимальнаяЧастота = КонвертацияЗначенийCpuInfo.СтрокаВЧисло(Значение);
			МаксимальнаяЧастота = КонвертацияЗначенийCpuInfo.МегагерцыВГерцы(МаксимальнаяЧастота);
			ИнформацияОПроцессоре.МаксимальнаяЧастота = МаксимальнаяЧастота;
		КонецЕсли;

		Если Имя = "model name" Тогда
			Если ИменаМоделей.Найти(Значение) = Неопределено Тогда
				ИменаМоделей.Добавить(Значение);
			КонецЕсли;
		КонецЕсли;

		Если Имя = "core(s) per socket" Тогда
			КоличествоЯдер = КонвертацияЗначенийCpuInfo.СтрокаВЧисло(Значение);
			Если КоличествоЯдер > 0 Тогда
				КоличествоЯдерВСокете = КоличествоЯдер;
			КонецЕсли;
		КонецЕсли;

		Если Имя = "cpu(s)" Тогда
			КоличествоЛогическихПроцессоров = КонвертацияЗначенийCpuInfo.СтрокаВЧисло(Значение);
		КонецЕсли;

		Если Имя = "socket(s)" Тогда
			КоличествоСокетов = КонвертацияЗначенийCpuInfo.СтрокаВЧисло(Значение);
		КонецЕсли;

		Если Имя = "architecture" Тогда
			ИнформацияОПроцессоре.Архитектура = АрхитектураПоСтроке(Значение);
		КонецЕсли;

	КонецЦикла;

	Если ИнформацияОПроцессоре.КоличествоЯдер = 0 Тогда
		КоличествоСокетовДляРасчета = ?(КоличествоСокетов > 0, КоличествоСокетов, 1);
		ИнформацияОПроцессоре.КоличествоЯдер = КоличествоЯдерВСокете * КоличествоСокетовДляРасчета;
	КонецЕсли;

	Если ИнформацияОПроцессоре.КоличествоЛогическихПроцессоров = 0 Тогда
		ИнформацияОПроцессоре.КоличествоЛогическихПроцессоров = КоличествоЛогическихПроцессоров;
	КонецЕсли;

	Если ИнформацияОПроцессоре.КоличествоПроцессоров = 0 Тогда
		ИнформацияОПроцессоре.КоличествоПроцессоров = КоличествоСокетов;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьЧастотуИзСпискаМоделей(Модели)

	Для Каждого Модель Из Модели Цикл

		Частота = ПолучитьЧастотуИзСтрокиМодели(Модель);

		Если Частота > 0 Тогда
			Возврат Частота;
		КонецЕсли;

	КонецЦикла;

	Возврат 0;
	
КонецФункции

Функция ПолучитьЧастотуИзСтрокиМодели(СтрокаМодели)

	Частота = 0;

	РегулярноеВыражение = Новый РегулярноеВыражение("(\d.\d+)GHz");
	РегулярноеВыражение.ИгнорироватьРегистр = Истина;

	Совпадения = РегулярноеВыражение.НайтиСовпадения(СтрокаМодели);
	Если Совпадения.Количество() > 0 И Совпадения[0].Группы.Количество() > 1 Тогда
		Частота = КонвертацияЗначенийCpuInfo.СтрокаВЧисло(Совпадения[0].Группы[1].Значение);
		Частота = КонвертацияЗначенийCpuInfo.ГигагерцыВГерцы(Частота);
	КонецЕсли;

	Возврат Частота;

КонецФункции

Функция АрхитектураПоСтроке(Знач СтрокаАрхитектуры)
	
	Если Не ЗначениеЗаполнено(СтрокаАрхитектуры) Тогда
		Возврат Неопределено;
	КонецЕсли;

	СтрокаАрхитектуры = НРег(СтрокаАрхитектуры);

	Если ЕстьСовпадение("^i\d86$|^x86$|^x86_32$|^i86pc$|^ia32$|^ia-32$|^bepc$", СтрокаАрхитектуры) Тогда
		Возврат АрхитектурыПроцессоров.X86;
	ИначеЕсли ЕстьСовпадение("^x64$|^x86_64$|^x86_64t$|^i686-64$|^amd64$|^ia64$|^ia-64$", СтрокаАрхитектуры) Тогда
		Возврат АрхитектурыПроцессоров.X64;
	ИначеЕсли ЕстьСовпадение("^armv8-a|aarch64$", СтрокаАрхитектуры) Тогда
		Возврат АрхитектурыПроцессоров.ARM64;
	ИначеЕсли ЕстьСовпадение("^armv7$|^armv7[a-z]$|^armv7-[a-z]$|^armv6[a-z]|armv8$|^armv8[a-z]$|^armv8-[a-z]$", СтрокаАрхитектуры) Тогда
		Возврат АрхитектурыПроцессоров.ARM;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ЕстьСовпадение(Шаблон, Значение)
	Возврат Новый РегулярноеВыражение(Шаблон).Совпадает(Значение);
КонецФункции
