// BSLLS:ExportVariables-off

#Использовать "../internal"

// Строка - наименование модели процессора.
Перем ИмяПроцессора Экспорт;

// Число - количество физических процессоров.
Перем КоличествоПроцессоров Экспорт;

// Число - количество физических ядер.
Перем КоличествоЯдер Экспорт;

// Число - количество логических процессоров.
Перем КоличествоЛогическихПроцессоров Экспорт;

// Число - номинальная частота процессора в герцах.
Перем НоминальнаяЧастота Экспорт;

// Число - максимальная частота процессора в герцах.
Перем МаксимальнаяЧастота Экспорт;

// Строка, Неопределено - архитектура процессора, см. АрхитектурыПроцессоров.
Перем Архитектура Экспорт;

Перем _ФорматировщикОписания; // ФорматировщикОписанияПроцессора

#Область ОбработчикиСобытий

// Конструктор класса.
//
// Параметры:
//   ЗаполнитьДанными - Булево - Признак автоматического сбора информации о процессоре при создании объекта
//                               Если Истина, данные о процессоре собираются и кэшируются.
//                               Если Ложь, свойства остаются неинициализированными.
//                               По умолчанию: Истина.
//
// Вызывает исключение:
//   Если не удалось выполнить команду сбора информации о процессоре
Процедура ПриСозданииОбъекта(ЗаполнитьДанными = Истина)
	
	ИмяПроцессора = "";
	КоличествоПроцессоров = 0;
	КоличествоЯдер = 0;
	КоличествоЛогическихПроцессоров = 0;
	НоминальнаяЧастота = 0;
	МаксимальнаяЧастота = 0;
	Архитектура = Неопределено;

	Если ЗаполнитьДанными Тогда
		ЗаполнитьДаннымиОПроцессоре();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает полное описание характеристик процессора.
//
// Возвращаемое значение:
//   Строка
Функция ПолноеОписание() Экспорт
	Возврат ФорматировщикОписания().ПолноеОписание(ЭтотОбъект);
КонецФункции

// Возвращает краткое описание характеристик процессора.
//
// Возвращаемое значение:
//   Строка
Функция КраткоеОписание() Экспорт
	Возврат ФорматировщикОписания().КраткоеОписание(ЭтотОбъект);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДаннымиОПроцессоре()

	Попытка
		ИнформацияОПроцессоре = ДетекторПроцессора.Определить();
		Если Не ИнформацияОПроцессоре = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ИнформацияОПроцессоре);
		КонецЕсли;		
	Исключение
		ВызватьИсключение "Не удалось заполнить данными о процессоре: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

Функция ФорматировщикОписания()

	Если _ФорматировщикОписания = Неопределено Тогда
		_ФорматировщикОписания = Новый ФорматировщикОписанияПроцессора();
	КонецЕсли;

	Возврат _ФорматировщикОписания;

КонецФункции

#КонецОбласти
