// BSLLS:LatinAndCyrillicSymbolInWord-off
#Использовать "../src/internal"

Перем _ИсточникComWmi; // ИсточникИнформацииОПроцессореComWmi
Перем _ИсточникWmic; // ИсточникИнформацииОПроцессореWmic
Перем _ИсточникPowerShellCim; // ИсточникИнформацииОПроцессореPowerShellCim

&МониторингПамяти
&КоличествоИтераций(5)
&КоличествоПрогревочныхИтераций(0)
&КоличествоВызововЗаИтерацию(1)
&КолонкаМакс

// Создает источники информации о процессоре для сравнения.
Процедура ПриСозданииОбъекта()

	_ИсточникComWmi = Новый ИсточникИнформацииОПроцессореComWmi();
	_ИсточникWmic = Новый ИсточникИнформацииОПроцессореWmic();
	_ИсточникPowerShellCim = Новый ИсточникИнформацииОПроцессореPowerShellCim();

КонецПроцедуры

&Бенчмарк(Наименование = "COM WMI")
&Эталон
Процедура ComWmi() Экспорт

	_ИсточникComWmi.Получить();

КонецПроцедуры

&Бенчмарк(Наименование = "WMIC")
Процедура Wmic() Экспорт

	_ИсточникWmic.Получить();

КонецПроцедуры

&Бенчмарк(Наименование = "PowerShell CIM")
Процедура Cim() Экспорт

	_ИсточникPowerShellCim.Получить();

КонецПроцедуры
