#Использовать asserts
#Использовать "../../../src"

Процедура ПроверитьРавенство(ПроверяемоеЗначение, ОжидаемоеЗначение) Экспорт
	
	Ожидаем.Что(ТипЗнч(ПроверяемоеЗначение)).Равно(Тип("ИнформацияОПроцессоре"));
	Ожидаем.Что(ПроверяемоеЗначение.ИмяПроцессора, "Имя процессора").Равно(ОжидаемоеЗначение.ИмяПроцессора);
	Ожидаем.Что(ПроверяемоеЗначение.КоличествоПроцессоров, "Количество процессоров").Равно(ОжидаемоеЗначение.КоличествоПроцессоров);
	Ожидаем.Что(ПроверяемоеЗначение.КоличествоЯдер, "Количество ядер").Равно(ОжидаемоеЗначение.КоличествоЯдер);
	Ожидаем.Что(ПроверяемоеЗначение.КоличествоЛогическихПроцессоров, "Количество логических процессоров").Равно(ОжидаемоеЗначение.КоличествоЛогическихПроцессоров);
	Ожидаем.Что(ПроверяемоеЗначение.НоминальнаяЧастота, "Номинальная частота").Равно(ОжидаемоеЗначение.НоминальнаяЧастота);
	Ожидаем.Что(ПроверяемоеЗначение.МаксимальнаяЧастота, "Максимальная частота").Равно(ОжидаемоеЗначение.МаксимальнаяЧастота);

КонецПроцедуры

Функция ПрочитатьФайл(ИмяФайла) Экспорт

	ЧтениеТекста = Новый ЧтениеТекста("tests/fixtures/" + ИмяФайла);
	Результат = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Возврат Результат;
	
КонецФункции