#Использовать asserts
#Использовать "../../../src"

Процедура ПроверитьРавенство(ПроверяемоеЗначение, ОжидаемоеЗначение, Описание = "") Экспорт
	
	Если ЗначениеЗаполнено(Описание) Тогда
		Описание = Описание + "
		|Проверяемое поле: ";
	Иначе
		Описание = "";
	КонецЕсли;

	Ожидаем.Что(ТипЗнч(ПроверяемоеЗначение)).Равно(Тип("ИнформацияОПроцессоре"));
	Ожидаем.Что(ПроверяемоеЗначение.ИмяПроцессора, Описание + "Имя процессора").Равно(ОжидаемоеЗначение.ИмяПроцессора);
	Ожидаем.Что(ПроверяемоеЗначение.КоличествоПроцессоров, Описание + "Количество процессоров").Равно(ОжидаемоеЗначение.КоличествоПроцессоров);
	Ожидаем.Что(ПроверяемоеЗначение.КоличествоЯдер, Описание + "Количество ядер").Равно(ОжидаемоеЗначение.КоличествоЯдер);
	Ожидаем.Что(ПроверяемоеЗначение.КоличествоЛогическихПроцессоров, Описание + "Количество логических процессоров").Равно(ОжидаемоеЗначение.КоличествоЛогическихПроцессоров);
	Ожидаем.Что(ПроверяемоеЗначение.НоминальнаяЧастота, Описание + "Номинальная частота").Равно(ОжидаемоеЗначение.НоминальнаяЧастота);
	Ожидаем.Что(ПроверяемоеЗначение.МаксимальнаяЧастота, Описание + "Максимальная частота").Равно(ОжидаемоеЗначение.МаксимальнаяЧастота);
	Ожидаем.Что(ПроверяемоеЗначение.Архитектура, Описание + "Архитектура").Равно(ОжидаемоеЗначение.Архитектура);

КонецПроцедуры

Функция ПрочитатьФайл(ИмяФайла) Экспорт

	ЧтениеТекста = Новый ЧтениеТекста("tests/fixtures/" + ИмяФайла);
	Результат = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Возврат Результат;
	
КонецФункции